## Day 14
### pandas

In [104]:
import pandas as pd
import numpy as np

In [105]:
sales_data = pd.Series([250,np.nan,175,300,np.nan,220],index =[7,4,3,2,8,9])
sales_data.isnull() # Check for null values ,return true for nulls

7    False
4     True
3    False
2    False
8     True
9    False
dtype: bool

In [106]:
#create 2 series of data
week1_sales = np.linspace(start=0,stop=300,num=5)
week2_sales = np.linspace(start=0,stop=400,num=5)

week1_sales_series = pd.Series(data = week1_sales)
week2_sales_series = pd.Series(data = week2_sales)
print("Week 1 Sales Series:")
print(week1_sales_series)

print("\n\nWeek 2 Sales Series:")
print(week2_sales_series)

Week 1 Sales Series:
0      0.0
1     75.0
2    150.0
3    225.0
4    300.0
dtype: float64


Week 2 Sales Series:
0      0.0
1    100.0
2    200.0
3    300.0
4    400.0
dtype: float64

In [107]:
# Concatenate the two series
pd.concat([week1_sales_series, week2_sales_series])

0      0.0
1     75.0
2    150.0
3    225.0
4    300.0
0      0.0
1    100.0
2    200.0
3    300.0
4    400.0
dtype: float64

In [108]:
# week1_sales_series.append(week2_sales_series)
# Concatenating the two series using append method
# Note: The append method is deprecated in future versions of pandas, use concat instead.

In [109]:
# create a data frame from a list
machine_learning=['python','Numpy','pandas','matplotlib','Ml algorithms','statistics']
df = pd.DataFrame(machine_learning , columns=['Machine Learning Topics'])
print("\n\nDataFrame from list:")
print(df)

DataFrame from list:
  Machine Learning Topics
0                  python
1                   Numpy
2                  pandas
3              matplotlib
4           Ml algorithms
5              statistics

In [110]:
#create a data frame from list of lists
course_list=[['Ml foundation',8000],['IoT',5000],['Web development',6500],['O level',4500]]
df2 = pd.DataFrame(course_list, columns=['Course Name', 'Fee'])
print("\n\nDataFrame from list of lists:\n")
print(df2)

DataFrame from list of lists:

       Course Name   Fee
0    Ml foundation  8000
1              IoT  5000
2  Web development  6500
3          O level  4500

In [111]:
#create a data frame from a dictionary
data ={
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24,27, 22],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print("\n\nDataFrame from dictionary:\n")
print(df)

DataFrame from dictionary:

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

In [112]:
#data frame with custom index
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data, index=['A1', 'A2', 'A3'])
print("\n\nDataFrame with custom index:\n")
print(df)

DataFrame with custom index:

       Name  Age         City
A1    Alice   24     New York
A2      Bob   27  Los Angeles
A3  Charlie   22      Chicago

In [113]:
#create a data frame from a  list of dictionary
sales_data = [
    {'date': '2025-06-01', 'product': 'laptop','units_sold': 5, 'revenue': 50000},
    {'date': '2025-06-02', 'product': 'Mouse','units_sold': 25, 'revenue': 2500},
    {'date': '2025-06-03', 'product': 'keyboard','units_sold': 15, 'revenue': 7500},
    {'date': '2025-06-04', 'product': 'Monitor','units_sold': 7, 'revenue': 21000}
]
df = pd.DataFrame(sales_data)
print("\n\nDataFrame from list of dictionaries:\n")
print(df)

DataFrame from list of dictionaries:

         date   product  units_sold  revenue
0  2025-06-01    laptop           5    50000
1  2025-06-02     Mouse          25     2500
2  2025-06-03  keyboard          15     7500
3  2025-06-04   Monitor           7    21000

## import files using pandas

In [114]:
df = pd.read_excel('Dataset/dataset1.xlsx', sheet_name='Sheet1') # Read data from an Excel file
print("\n\nDataFrame from Excel file:\n")
df

DataFrame from Excel file:

      Name   Age         City  Pincode
0      Tony   23          USA     5453
1      Thor   25       Asgard     4323
2  Natasha    19          USA     4236
3     Brush   30          USA     4565
4   Tichala   28      Wakanda     7897
5    Naruto   26  Hidden Leaf     6775
6      Goku   18  Mount Paozu     2767
7    Liyasa   22        Korea     3456

In [115]:
df1 = pd.read_csv('Dataset/dataset11.csv')  # Read a CSV file into a DataFrame
print("\n\nDataFrame from CSV file:\n")
df1

DataFrame from CSV file:

   EmployeeID   Name  age
0             1    A    23
1             4    B    45
2             5    C    56
3             6    D    77

In [116]:
df.head()  # Display the first few rows of the DataFrame

      Name   Age     City  Pincode
0      Tony   23      USA     5453
1      Thor   25   Asgard     4323
2  Natasha    19      USA     4236
3     Brush   30      USA     4565
4   Tichala   28  Wakanda     7897

In [117]:
df.head(2)  # Display the first two rows of the DataFrame

  Name   Age    City  Pincode
0  Tony   23     USA     5453
1  Thor   25  Asgard     4323

In [118]:
df.tail()  # Display the last few rows of the DataFrame

     Name   Age         City  Pincode
3    Brush   30          USA     4565
4  Tichala   28      Wakanda     7897
5   Naruto   26  Hidden Leaf     6775
6     Goku   18  Mount Paozu     2767
7   Liyasa   22        Korea     3456

In [119]:
df.tail(2)  # Display the last two rows of the DataFrame

    Name   Age         City  Pincode
6    Goku   18  Mount Paozu     2767
7  Liyasa   22        Korea     3456

In [120]:
df.describe()  # Get a statistical summary of the DataFrame

             Age     Pincode
count   8.000000     8.00000
mean   23.875000  4934.00000
std     4.189698  1703.57062
min    18.000000  2767.00000
25%    21.250000  4041.00000
50%    24.000000  4444.00000
75%    26.500000  5783.50000
max    30.000000  7897.00000

In [121]:
df.info() # Get information about the DataFrame, including data types and non-null counts

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     8 non-null      object
 1   Age      8 non-null      int64
 2   City     8 non-null      object
 3   Pincode  8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 388.0+ bytes

In [122]:
# custom index
df.index =['Row1', 'Row2', 'Row3', 'Row4', 'Row5', 'Row6', 'Row7', 'Row8'] # Set custom index labels for the DataFrame
print("\n\nDataFrame with custom index labels:\n")
df

DataFrame with custom index labels:

         Name   Age         City  Pincode
Row1      Tony   23          USA     5453
Row2      Thor   25       Asgard     4323
Row3  Natasha    19          USA     4236
Row4     Brush   30          USA     4565
Row5   Tichala   28      Wakanda     7897
Row6    Naruto   26  Hidden Leaf     6775
Row7      Goku   18  Mount Paozu     2767
Row8    Liyasa   22        Korea     3456

In [123]:
df.columns  # Get the list of column names in the DataFrame

Index(['Name ', 'Age', 'City', 'Pincode'], dtype='object')

In [124]:
df.columns = ['Employee Name', 'Age of employee', 'city', 'pin']  # Rename the columns of the DataFrame
print("\n\nDataFrame with renamed columns:\n")
df

DataFrame with renamed columns:

     Employee Name  Age of employee         city   pin
Row1          Tony               23          USA  5453
Row2          Thor               25       Asgard  4323
Row3      Natasha                19          USA  4236
Row4         Brush               30          USA  4565
Row5       Tichala               28      Wakanda  7897
Row6        Naruto               26  Hidden Leaf  6775
Row7          Goku               18  Mount Paozu  2767
Row8        Liyasa               22        Korea  3456

In [125]:
df.city  # Access a specific column in the DataFrame using dot notation

Row1            USA
Row2         Asgard
Row3            USA
Row4            USA
Row5        Wakanda
Row6    Hidden Leaf
Row7    Mount Paozu
Row8          Korea
Name: city, dtype: object

In [126]:
df['Employee Name']  # Access a specific column in the DataFrame using bracket notation

Row1        Tony
Row2        Thor
Row3    Natasha
Row4       Brush
Row5     Tichala
Row6      Naruto
Row7        Goku
Row8      Liyasa
Name: Employee Name, dtype: object

In [127]:
df[['Employee Name', 'Age of employee']]  # Access multiple columns in the DataFrame using bracket notation

     Employee Name  Age of employee
Row1          Tony               23
Row2          Thor               25
Row3      Natasha                19
Row4         Brush               30
Row5       Tichala               28
Row6        Naruto               26
Row7          Goku               18
Row8        Liyasa               22

In [128]:
type(df) # Check the type of the DataFrame object

pandas.core.frame.DataFrame

In [129]:
df['Age of employee'].max()  # Get the maximum value in the 'Age of employee' column

30

In [130]:
df['Age of employee'].min()  # Get the minimum value in the 'Age of employee' column

18

In [131]:
df['Age of employee'].mean() # Get the mean (average) value in the 'Age of employee' column

23.875

In [132]:
df.index  # Get the index labels of the DataFrame

Index(['Row1', 'Row2', 'Row3', 'Row4', 'Row5', 'Row6', 'Row7', 'Row8'], dtype='object')

In [133]:
df.set_index('pin',inplace=True)  # Set the 'pin' column as the index of the DataFrame

In [136]:
# df.set_index('pin', inplace=False) # Set the 'pin' column as the index of the DataFrame without modifying the original DataFrame
# df.reset_index(inplace=True)  # Reset the index of the DataFrame, converting the index back to a column
# df.reset_index(inplace=False)  # Reset the index of the DataFrame without modifying the original DataFrame
# df.set_index('pin', inplace=True)  # Set the 'pin' column as the index of the DataFrame again
# df.sort_index(inplace=True)  # Sort the DataFrame by its index labels

In [137]:
df.columns

Index(['Employee Name', 'Age of employee', 'city'], dtype='object')

In [138]:
df

     Employee Name  Age of employee         city
pin
5453          Tony               23          USA
4323          Thor               25       Asgard
4236      Natasha                19          USA
4565         Brush               30          USA
7897       Tichala               28      Wakanda
6775        Naruto               26  Hidden Leaf
2767          Goku               18  Mount Paozu
3456        Liyasa               22        Korea